Config/Reports/СправкаРасчетКалькуляцииСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СправкаРасчетКалькуляцииСебестоимости</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокНоменклатуры</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/Enums/ДоступныеПериодыОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДоступныеПериодыОтчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйПериод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Reports/СправкаРасчетКалькуляцииСебестоимости/Forms/ФормаОтчета/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура СформироватьОтчетСервер()
	
	Если ПроверитьЗаполнение() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФОРМИРОВАНИЕОТЧЕТА");
		ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
		ОтчетОбъект.СформироватьОтчет(Результат);
		Элементы.ГруппаПанельНастроек.Видимость = Ложь;
		Элементы.ПанельНастроек.Пометка = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НЕИСПОЛЬЗОВАТЬ");
	КонецЕсли;

КонецПроцедуры // СформироватьОтчетСервер()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НЕАКТУАЛЬНОСТЬ");
	
	Параметры.Свойство("Организация",            Отчет.Организация);
	Параметры.Свойство("Подразделение",          Отчет.Подразделение);
	Параметры.Свойство("ИФО",                    Отчет.ИФО);
	Параметры.Свойство("КФО",                    Отчет.КФО);
	Параметры.Свойство("НачалоПериода",          Отчет.НачалоПериода);
	Параметры.Свойство("КонецПериода",           Отчет.КонецПериода);
	Параметры.Свойство("НаправлениеДеятельности",Отчет.НаправлениеДеятельности);
	Параметры.Свойство("СписокНоменклатуры",     Отчет.СписокНоменклатуры);
	Параметры.Свойство("ВидПериода",             ВидПериода);
	Параметры.Свойство("ДоступныеПериодыОтчета", ДоступныеПериодыОтчета);
	Параметры.Свойство("Период",                 Период);
	//
	//Если ДоступныеПериодыОтчета = Неопределено Тогда
	//	ДоступныеПериодыОтчета = СтандартныеОтчеты.ПолучитьДоступныеПериодыОтчета();
	//КонецЕсли;
	//СтандартныеОтчеты.ПолучитьСписокДоступныхПериодов(ДоступныеПериодыОтчета.День, 
	//	Элементы.ВидПериода.СписокВыбора);
	
	
	Если НЕ ЗначениеЗаполнено(Отчет.Организация) Тогда
		Отчет.Организация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Отчет.НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		ВидПериода = Перечисления.ДоступныеПериодыОтчета.Месяц;
		Отчет.НачалоПериода = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), -1));
		Отчет.КонецПериода = КонецМесяца(Отчет.НачалоПериода);
		Период = Формат(Отчет.НачалоПериода, "ДФ='MMMM yyyy'");
	//	Элементы.Период.ОбновитьТекстРедактирования();
	КонецЕсли;
	
	Если БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.60")).ЭлементГруппа Тогда
		Счет10961 = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.61");
	Иначе
		Счет10961 = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("109.60");
	КонецЕсли;
	Элементы.НаправлениеДеятельности.Видимость =
			БухгалтерскийУчетПовтИсп.ЕстьСубконтоСчета(Счет10961, ПланыВидовХарактеристик.ВидыСубконто.НаправленияДеятельности);
			
	Отчет.СписокНоменклатуры.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	Элементы.ПанельНастроек.Пометка = Истина;
			
	Если Параметры.СформироватьПриОткрытии = Истина Тогда
		СформироватьОтчетСервер();
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПанельНастроек(Команда)
	Элементы.ГруппаПанельНастроек.Видимость = Не Элементы.ГруппаПанельНастроек.Видимость;
	Элементы.ПанельНастроек.Пометка = Элементы.ГруппаПанельНастроек.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВНовомОкне(Команда)
	ПараметрыФормы = Новый Структура("СформироватьПриОткрытии, Организация, Подразделение, ИФО, КФО, НаправлениеДеятельности,
									 | НачалоПериода, КонецПериода, СписокНоменклатуры, ВидПериода, ДоступныеПериодыОтчета,
									 |Период", Истина);
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Отчет);									 
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, ЭтаФорма, "ВидПериода, ДоступныеПериодыОтчета, Период"); 
	ОткрытьФорму("Отчет.СправкаРасчетКалькуляцииСебестоимости.Форма.ФормаОтчета", ПараметрыФормы,, Истина);									 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НачалоПериода", Отчет.НачалоПериода);
	СтруктураПараметров.Вставить("КонецПериода",  Отчет.КонецПериода);
	
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(СтруктураПараметров, ЭтаФорма, "УстановитьПериодЗавершение");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершение(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Отчет.НачалоПериода = РезультатВыбора.НачалоПериода;
		Отчет.КонецПериода  = РезультатВыбора.КонецПериода;
		ЭтаФорма.Модифицированность = Истина;
		
		СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КФОПриИзменении(Элемент)
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеДеятельностиПриИзменении(Элемент)
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПриИзменении(Элемент)
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
КонецПроцедуры
